app/views/books/index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
        <i><span class="glyphicon glyphicon-heart" aria-hidden="true"></span></i>
        <%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
        <i><span class="glyphicon glyphicon-heart-empty" aria-hidden="true"></span></i>
        <%= book.favorites.count %>

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
      </td>
      <td><%= link_to "コメント数：#{book.book_comments.count}", book_path(book.id) %></td>